zephyrproject-rtos/zephyr/drivers/counter/counter_stm32_timer.c
		r = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[1], &tim_clk);
		if (r < 0) {
			LOG_ERR("Timer clock rate get error (%d)", r);
			return r;
		}
	} else {
		LOG_ERR("Timer clock source is not specified");
		return -EINVAL;
	}

	data->freq = tim_clk / (cfg->prescaler + 1U);

	if (!device_is_ready(cfg->reset.dev)) {
		LOG_ERR("reset controller not ready");
		return -ENODEV;
	}

	/* Reset timer to default state using RCC */
	(void)reset_line_toggle_dt(&cfg->reset);

	/* config/enable IRQ */
	cfg->irq_config_func(dev);

#ifdef CONFIG_COUNTER_CAPTURE
	if (cfg->pcfg) {
		r = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
		if (r < 0) {
			LOG_ERR("%s: Counter Capture pinctrl setup failed (%d)", dev->name, r);
			return r;
		}
	}
#endif /* CONFIG_COUNTER_CAPTURE */

	/* initialize timer */
	LL_TIM_SetPrescaler(timer, cfg->prescaler);
	LL_TIM_SetAutoReload(timer, counter_get_max_top_value(dev));

	if (IS_TIM_COUNTER_MODE_SELECT_INSTANCE(timer)) {
		LL_TIM_SetCounterMode(timer, LL_TIM_COUNTERMODE_UP);
	}

	if (IS_TIM_CLOCK_DIVISION_INSTANCE(timer)) {
		LL_TIM_SetClockDivision(timer, LL_TIM_CLOCKDIVISION_DIV1);
	}

#ifdef IS_TIM_REPETITION_COUNTER_INSTANCE
	if (IS_TIM_REPETITION_COUNTER_INSTANCE(timer)) {
		LL_TIM_SetRepetitionCounter(timer, 0U);
	}
#endif

	if (IS_TIM_MASTER_INSTANCE(timer)) {
#if HAS_MASTERMODE_SUPPORT
		LL_TIM_SetTriggerOutput(timer, cfg->mastermode);
#endif
	} else {
		if (cfg->mastermode != 0) {
			LOG_ERR("%s: Timer does not support mastermode", dev->name);
			return -ENOTSUP;
		}
	}

	/* Generate an update event to reload the Prescaler
	 * and the repetition counter value (if applicable) immediately
	 */
	LL_TIM_GenerateEvent_UPDATE(timer);

	return 0;
}

static uint32_t counter_stm32_get_guard_period(const struct device *dev, uint32_t flags)
{
	struct counter_stm32_data *data = dev->data;

	ARG_UNUSED(flags);
	return data->guard_period;
}

static int counter_stm32_set_guard_period(const struct device *dev, uint32_t guard,
					  uint32_t flags)
{
	struct counter_stm32_data *data = dev->data;

	ARG_UNUSED(flags);
	__ASSERT_NO_MSG(guard < counter_stm32_get_top_value(dev));

	data->guard_period = guard;
	return 0;
}

static uint32_t counter_stm32_get_freq(const struct device *dev)
{
	struct counter_stm32_data *data = dev->data;

	return data->freq;
}

static int counter_stm32_set_value(const struct device *dev, uint32_t ticks)
{
	const struct counter_stm32_config *config = dev->config;
	TIM_TypeDef *timer = config->timer;

	LL_TIM_SetCounter(timer, ticks);

	return 0;
}


#ifdef CONFIG_COUNTER_CAPTURE
static int counter_stm32_enable_capture(const struct device *dev, uint8_t chan)
{
	const struct counter_stm32_config *config = dev->config;
	TIM_TypeDef *timer = config->timer;
	struct counter_stm32_ch_data *chdata = &config->ch_data[chan];

	/* Prevent configuring capture on a channel already used for alarms */
	if (chdata->alarm_cb != NULL) {
		LOG_ERR("%s: Channel %d already configured for alarm, cannot set capture",
			dev->name, chan);
		return -EBUSY;
	}

	/* Make sure a capture callback is set */
	if (chdata->capture_cb == NULL) {
		LOG_ERR("%s: Capture callback not set for channel %d, please configure",
			dev->name, chan);
		return -EINVAL;
	}

	/* enable interrupt */
	enable_it[chan](timer);

	LL_TIM_CC_EnableChannel(timer, ch2ll[chan]);

	return 0;
}

static int counter_stm32_disable_capture(const struct device *dev, uint8_t chan)
{
	const struct counter_stm32_config *config = dev->config;
	struct counter_stm32_ch_data *chdata = &config->ch_data[chan];
	TIM_TypeDef *timer = config->timer;

	LL_TIM_CC_DisableChannel(timer, ch2ll[chan]);

	/* disable interrupt */
	disable_it[chan](timer);
	chdata->capture_cb = NULL;

	return 0;
}

static int counter_stm32_capture_configure(const struct device *dev, uint8_t chan,
					      counter_capture_flags_t flags,
					      counter_capture_cb_t cb, void *user_data)
{
	const struct counter_stm32_config *config = dev->config;
	struct counter_stm32_ch_data *chdata = &config->ch_data[chan];
	TIM_TypeDef *timer = config->timer;
	uint32_t config_flags = LL_TIM_ACTIVEINPUT_DIRECTTI;

	/* Prevent configuring capture on a channel already used for alarms */
	if (chdata->alarm_cb != NULL) {
		LOG_ERR("%s: Channel %d already configured for alarm, cannot set capture",
			dev->name, chan);
		return -EBUSY;
	}

	/* Config is only writable when it is off */
	if (LL_TIM_CC_IsEnabledChannel(timer, ch2ll[chan])) {
		LOG_ERR("%s: Capture channel %d is enabled, cannot reconfigure", dev->name, chan);
		return -EBUSY;
	}

	/* Configure polarity */
	if ((flags & COUNTER_CAPTURE_BOTH_EDGES) == COUNTER_CAPTURE_BOTH_EDGES) {
		config_flags |= LL_TIM_IC_POLARITY_BOTHEDGE;
	} else if (flags & COUNTER_CAPTURE_FALLING_EDGE) {
		config_flags |= LL_TIM_IC_POLARITY_FALLING;
	} else if (flags & COUNTER_CAPTURE_RISING_EDGE) {
		config_flags |= LL_TIM_IC_POLARITY_RISING;
	} else {
		return -EINVAL;
	}

	/* Configure prescaler */
	switch (flags & COUNTER_CAPTURE_STM32_PRESCALER_DIV_MSK) {
	case COUNTER_CAPTURE_STM32_PRESCALER_DIV1:
		config_flags |= LL_TIM_ICPSC_DIV1;
		break;
	case COUNTER_CAPTURE_STM32_PRESCALER_DIV2:
		config_flags |= LL_TIM_ICPSC_DIV2;
		break;
	case COUNTER_CAPTURE_STM32_PRESCALER_DIV4:
		config_flags |= LL_TIM_ICPSC_DIV4;
		break;
	case COUNTER_CAPTURE_STM32_PRESCALER_DIV8:
		config_flags |= LL_TIM_ICPSC_DIV8;
		break;
	default:
		return -EINVAL;
	}

	/* Configure filter */
	switch (flags & COUNTER_CAPTURE_STM32_FILTER_MSK) {
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV1_N1:
		config_flags |= LL_TIM_IC_FILTER_FDIV1;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_TIM_KER_CK_N2:
		config_flags |= LL_TIM_IC_FILTER_FDIV1_N2;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_TIM_KER_CK_N4:
		config_flags |= LL_TIM_IC_FILTER_FDIV1_N4;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_TIM_KER_CK_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV1_N8;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV2_N6:
		config_flags |= LL_TIM_IC_FILTER_FDIV2_N6;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV2_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV2_N8;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV4_N6:
		config_flags |= LL_TIM_IC_FILTER_FDIV4_N6;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV4_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV4_N8;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV8_N6:
		config_flags |= LL_TIM_IC_FILTER_FDIV8_N6;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV8_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV8_N8;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV16_N5:
		config_flags |= LL_TIM_IC_FILTER_FDIV16_N5;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV16_N6:
		config_flags |= LL_TIM_IC_FILTER_FDIV16_N6;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV16_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV16_N8;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV32_N5:
		config_flags |= LL_TIM_IC_FILTER_FDIV32_N5;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV32_N6:
		config_flags |= LL_TIM_IC_FILTER_FDIV32_N6;
		break;
	case COUNTER_CAPTURE_STM32_FILTER_DTS_DIV32_N8:
		config_flags |= LL_TIM_IC_FILTER_FDIV32_N8;
		break;
	default:
		return -EINVAL;
	}

	chdata->capture_cb = cb;
	chdata->user_data = user_data;
	chdata->single_shot_capture = (flags & COUNTER_CAPTURE_SINGLE_SHOT) ? true : false;

	/* Apply configuration */
	LL_TIM_IC_Config(timer, ch2ll[chan], config_flags);

