zephyrproject-rtos/zephyr/drivers/counter/counter_stm32_timer.c
	return 0;
}
#endif

static void counter_stm32_top_irq_handle(const struct device *dev)
{
	struct counter_stm32_data *data = dev->data;

	counter_top_callback_t cb = data->top_cb;

	__ASSERT(cb != NULL, "top event enabled - expecting callback");
	cb(dev, data->top_user_data);
}

static void counter_stm32_irq_handle(const struct device *dev, uint32_t id)
{
	const struct counter_stm32_config *config = dev->config;
	struct counter_stm32_data *data = dev->data;
	TIM_TypeDef *timer = config->timer;

	struct counter_stm32_ch_data *chdata;

	atomic_and(&data->cc_int_pending, ~BIT(id));

	chdata = &config->ch_data[id];

#ifdef CONFIG_COUNTER_CAPTURE
	/* With Counter Capture, we need to check which mode it was configured for */
	if (LL_TIM_IC_GetActiveInput(timer, ch2ll[id]) == LL_TIM_ACTIVEINPUT_DIRECTTI) {
		counter_capture_cb_t cb = chdata->capture_cb;

		/*
		 * CCxOF is also set if at least two consecutive captures
		 * occurred whereas the flag was not cleared
		 */
		if (get_over_capture[id](timer)) {
			LOG_ERR("%s: overcapture on channel %d", dev->name, id);
			clear_over_capture[id](timer);
		}

		if (cb) {
			uint32_t cc_val = get_timer_capture[id](timer);
			uint32_t pol = LL_TIM_IC_GetPolarity(timer, ch2ll[id]);
			uint32_t filter = LL_TIM_IC_GetFilter(timer, ch2ll[id]);
			uint32_t prescaler = LL_TIM_IC_GetPrescaler(timer, ch2ll[id]);
			counter_capture_flags_t flags = 0;

			/* translate stm32 flags to zephyr flags */
			if (pol == LL_TIM_IC_POLARITY_RISING) {
				flags = COUNTER_CAPTURE_RISING_EDGE;
			} else if (pol == LL_TIM_IC_POLARITY_FALLING) {
				flags = COUNTER_CAPTURE_FALLING_EDGE;
			} else if (pol == LL_TIM_IC_POLARITY_BOTHEDGE) {
				flags = COUNTER_CAPTURE_BOTH_EDGES;
			}

			/* Set Vendor flags */
			flags |= FIELD_PREP(COUNTER_CAPTURE_STM32_FILTER_MSK, filter);
			flags |= FIELD_PREP(COUNTER_CAPTURE_STM32_PRESCALER_DIV_MSK, prescaler);

			/* For single shot capture, disable the channel after capture event */
			if (chdata->single_shot_capture) {
				flags |= COUNTER_CAPTURE_SINGLE_SHOT;
				counter_stm32_disable_capture(dev, id);
			} else {
				flags |= COUNTER_CAPTURE_CONTINUOUS;
			}

			cb(dev, id, flags, cc_val, chdata->user_data);
		}
	} else {
#endif
		counter_alarm_callback_t cb;

		/* alarm is one-shot, disable the interrupt after it fires */
		disable_it[id](timer);

		cb = chdata->alarm_cb;
		chdata->alarm_cb = NULL;

		if (cb) {
			uint32_t cc_val = get_timer_compare[id](timer);

			cb(dev, id, cc_val, chdata->user_data);
		}
#ifdef CONFIG_COUNTER_CAPTURE
	}
#endif
}

static DEVICE_API(counter, counter_stm32_driver_api) = {
	.start = counter_stm32_start,
	.stop = counter_stm32_stop,
	.get_value = counter_stm32_get_value,
	.reset = counter_stm32_reset,
	.set_alarm = counter_stm32_set_alarm,
	.cancel_alarm = counter_stm32_cancel_alarm,
	.set_top_value = counter_stm32_set_top_value,
	.get_pending_int = counter_stm32_get_pending_int,
	.get_top_value = counter_stm32_get_top_value,
	.get_guard_period = counter_stm32_get_guard_period,
	.set_guard_period = counter_stm32_set_guard_period,
	.get_freq = counter_stm32_get_freq,
	.set_value = counter_stm32_set_value,
#ifdef CONFIG_COUNTER_CAPTURE
	.enable_capture = counter_stm32_enable_capture,
	.disable_capture = counter_stm32_disable_capture,
	.capture_configure = counter_stm32_capture_configure,
#endif
};

#define TIM_IRQ_HANDLE_CC(timx, cc)						\
	do {									\
		bool hw_irq = LL_TIM_IsActiveFlag_CC##cc(timer) &&		\
			      LL_TIM_IsEnabledIT_CC##cc(timer);			\
		if (hw_irq || (data->cc_int_pending & BIT(cc - 1U))) {		\
			if (hw_irq) {						\
				LL_TIM_ClearFlag_CC##cc(timer);			\
			}							\
			counter_stm32_irq_handle(dev, cc - 1U);			\
		}								\
	} while (0)

static void counter_stm32_irq_handler_cc(const struct device *dev)
{
	const struct counter_stm32_config *config = dev->config;
	struct counter_stm32_data *data = dev->data;
	TIM_TypeDef *timer = config->timer;

	/* Capture compare events */
	switch (counter_get_num_of_channels(dev)) {
	case 4U:
		TIM_IRQ_HANDLE_CC(timer, 4);
		__fallthrough;
	case 3U:
		TIM_IRQ_HANDLE_CC(timer, 3);
		__fallthrough;
	case 2U:
		TIM_IRQ_HANDLE_CC(timer, 2);
		__fallthrough;
	case 1U:
		TIM_IRQ_HANDLE_CC(timer, 1);
		__fallthrough;
	default:
		break;
	}
}

static void counter_stm32_irq_handler_up(const struct device *dev)
{
	const struct counter_stm32_config *config = dev->config;
	TIM_TypeDef *timer = config->timer;

	/* TIM Update event */
	if (LL_TIM_IsActiveFlag_UPDATE(timer) && LL_TIM_IsEnabledIT_UPDATE(timer)) {
		LL_TIM_ClearFlag_UPDATE(timer);
		counter_stm32_top_irq_handle(dev);
	}
}

static void counter_stm32_irq_handler_brk_up_trg_com(const struct device *dev)
{
	counter_stm32_irq_handler_up(dev);
}

static void counter_stm32_irq_handler_global(const struct device *dev)
{
	counter_stm32_irq_handler_cc(dev);
	counter_stm32_irq_handler_brk_up_trg_com(dev);
}

#define TIMER(idx)              DT_INST_PARENT(idx)

/** TIMx instance from DT */
#define TIM(idx) ((TIM_TypeDef *)DT_REG_ADDR(TIMER(idx)))

#if defined(CONFIG_GIC)
#define COUNTER_STM32_GET_IRQ_FLAGS(index, name) DT_IRQ_BY_NAME(TIMER(index), name, flags)
#else /* NVIC */
#define COUNTER_STM32_GET_IRQ_FLAGS(index, name) 0
#endif /* CONFIG_GIC */

#define IRQ_CONNECT_AND_ENABLE_BY_NAME(index, name)				\
{										\
	IRQ_CONNECT(DT_IRQ_BY_NAME(TIMER(index), name, irq),			\
		    DT_IRQ_BY_NAME(TIMER(index), name, priority),		\
		    counter_stm32_irq_handler_##name, DEVICE_DT_INST_GET(index),	\
		    COUNTER_STM32_GET_IRQ_FLAGS(index, name));			\
	irq_enable(DT_IRQ_BY_NAME(TIMER(index), name, irq));			\
}

#define COUNTER_DEVICE_INIT(idx)						  \
	BUILD_ASSERT(DT_PROP(TIMER(idx), st_prescaler) <= 0xFFFF,		  \
		     "TIMER prescaler out of range");				  \
	BUILD_ASSERT(NUM_CH(TIM(idx)) <= TIMER_MAX_CH,				  \
		     "TIMER too many channels");				  \
										  \
	IF_ENABLED(CONFIG_COUNTER_CAPTURE,					  \
		(IF_ENABLED(DT_INST_PINCTRL_HAS_NAME(idx, default),		  \
		(PINCTRL_DT_INST_DEFINE(idx);))))				  \
										  \
	static struct counter_stm32_data counter##idx##_data;			  \
	static struct counter_stm32_ch_data counter##idx##_ch_data[TIMER_MAX_CH]; \
										  \
	static void counter_##idx##_stm32_irq_config(const struct device *dev)	  \
	{									  \
		IF_ENABLED(DT_IRQ_HAS_NAME(TIMER(idx), up),			  \
			(IRQ_CONNECT_AND_ENABLE_BY_NAME(idx, up)))		  \
		IF_ENABLED(DT_IRQ_HAS_NAME(TIMER(idx), brk_up_trg_com),		  \
			(IRQ_CONNECT_AND_ENABLE_BY_NAME(idx, brk_up_trg_com)))	  \
		COND_CASE_1(							  \
			DT_IRQ_HAS_NAME(TIMER(idx), cc),			  \
				(IRQ_CONNECT_AND_ENABLE_BY_NAME(idx, cc)),	  \
			DT_IRQ_HAS_NAME(TIMER(idx), global),			  \
				(IRQ_CONNECT_AND_ENABLE_BY_NAME(idx, global)),	  \
		(BUILD_ASSERT(0, "Timer has no 'cc' or 'global' interrupt!")))	  \
	}									  \
										  \
	static const struct stm32_pclken pclken_##idx[] =			  \
					STM32_DT_CLOCKS(TIMER(idx));		  \
										  \
	static const struct counter_stm32_config counter##idx##_config = {	  \
		.info = {							  \
			.max_top_value =					  \
				IS_TIM_32B_COUNTER_INSTANCE(TIM(idx)) ?		  \
				0xFFFFFFFF : 0x0000FFFF,			  \
			.flags = COUNTER_CONFIG_INFO_COUNT_UP,			  \
			.channels = NUM_CH(TIM(idx)),				  \
		},								  \
		.ch_data = counter##idx##_ch_data,				  \
		.timer = TIM(idx),						  \
		.prescaler = DT_PROP(TIMER(idx), st_prescaler),			  \
		.mastermode = COND_CODE_1(					  \
			HAS_MASTERMODE_SUPPORT,					  \
			(CONCAT(LL_TIM_TRGO_,					  \
				DT_STRING_TOKEN(DT_INST_PARENT(idx),		  \
				st_mastermode))),				  \
			(0)),							  \
		.pclken = pclken_##idx,						  \
		.pclk_len = DT_NUM_CLOCKS(TIMER(idx)),				  \
		.irq_config_func = counter_##idx##_stm32_irq_config,		  \
		.irqn = COND_CODE_1(DT_IRQ_HAS_NAME(TIMER(idx), cc),		  \
				    (DT_IRQ_BY_NAME(TIMER(idx), cc, irq)),	  \
				    (DT_IRQ_BY_NAME(TIMER(idx), global, irq))),	  \
		.reset = RESET_DT_SPEC_GET(TIMER(idx)),				  \
		IF_ENABLED(CONFIG_COUNTER_CAPTURE,				  \
			(.pcfg = COND_CODE_1(					  \
				DT_NODE_HAS_PROP(DT_DRV_INST(idx), pinctrl_0),	  \
				(PINCTRL_DT_INST_DEV_CONFIG_GET(idx)), (NULL)),)) \
	};									  \
										  \
	DEVICE_DT_INST_DEFINE(idx,						  \
			      counter_stm32_init_timer,				  \
			      NULL,						  \
			      &counter##idx##_data,				  \
			      &counter##idx##_config,				  \
			      PRE_KERNEL_1, CONFIG_COUNTER_INIT_PRIORITY,	  \
			      &counter_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(COUNTER_DEVICE_INIT)
